app/controllers/event_attendees_controller.rb

def find_event
  @event = Event.find( params[:event_id] )
---
SELECT "events".* FROM "events" WHERE "events"."id" = ? LIMIT 1  [["id", "3"]]