app/controllers/events_controller.rb

SELECT "events".* FROM "events" LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM "events"
---
  def index
	@events=Event.page(params[:page]).per(5)

INSERT INTO "events" ("created_at", "description", "name", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Sun, 12 Jan 2014 00:54:56 UTC +00:00], ["description", "11111111"], ["name", "11"], ["updated_at", Sun, 12 Jan 2014 00:54:56 UTC +00:00]]
---
  def create
	 @event=Event.new(params[:event].permit(:name,:description))
	 if @event.save

SELECT "events".* FROM "events" WHERE "events"."id" = ? LIMIT 1  [["id", "4"]]
UPDATE "events" SET "description" = ?, "updated_at" = ? WHERE "events"."id" = 13  [["description", "7777778888"], ["updated_at", Sun, 12 Jan 2014 01:52:14 UTC +00:00]]
---
def update
  @event = Event.find(params[:id])
  if @event.update_attributes(params[:event].permit(:name,:description))